Revit 2027 API
BackgroundProcessTask Class
Provides a container of all Revit built-in BackgroundProcessTaskType instances.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BackgroundProcessTask.BackgroundProcessTask
Namespace: Autodesk.Revit.DB.BackgroundProcessTask
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class BackgroundProcessTask
Public NotInheritable Class BackgroundProcessTask
public ref class BackgroundProcessTask abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type BackgroundProcessTask = class end
See Also
Reference
Autodesk.Revit.DB.BackgroundProcessTask Namespace